---
layout: post
date: 2013-12-09 00:44:15 +0800
title: emmet&vim
categories: note vim
tags: [vim,tools]
---

# Emmet 使用方法不完全介绍

## Lorem据生成器
```
	lorem(默认30)
	lorm100 (生成100单词)
```

```
p*4>lorem
```

## Child: > 
```
div>ul>li

```
```html
<div>
    <ul>
        <li></li>
    </ul>
</div>
```

## Sibling: +

```
div+p+bq
```

```html
<div></div>
<p></p>
<blockquote></blockquote>
```

## Climb-up: ^
jQuery -> end()

```
div+div>p>span+em 
```
```html
<div></div>
<div>
    <p><span></span><em></em></p>
</div>
```

```
div+div>p>span+em^bq
```

```html
<div></div>
<div>
    <p><span></span><em></em></p>
    <blockquote></blockquote>
</div>
```

```
div+div>p>span+em^^^bq
```

```html
<div></div>
<div>
    <p><span></span><em></em></p>
</div>
<blockquote></blockquote>

```
## Multiplication: *
With * operator you can define how many times element should be outputted:

```
ul>li*5
```

```html
<ul>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
    <li></li>
</ul>
```

## Grouping: ()

```
div>(header>ul>li*2>a)+footer>p
```

```html
<div>
    <header>
        <ul>
            <li><a href=""></a></li>
            <li><a href=""></a></li>
        </ul>
    </header>
    <footer>
        <p></p>
    </footer>
</div>
```

```
(div>dl>(dt+dd)*3)+footer>p
```

```html
<div>
    <dl>
        <dt></dt>
        <dd></dd>
        <dt></dt>
        <dd></dd>
        <dt></dt>
        <dd></dd>
    </dl>
</div>
<footer>
    <p></p>
</footer>
```

```
div#header+div.page+div#footer.class1.class2.class3
```

```html
<div id="header"></div>
<div class="page"></div>
<div id="footer" class="class1 class2 class3"></div>
```

```
ul>li.item$*5
```

```html
<ul>
    <li class="item1"></li>
    <li class="item2"></li>
    <li class="item3"></li>
    <li class="item4"></li>
    <li class="item5"></li>
</ul>
```

```
ul>li.item$$$*5
```

```html
<ul>
    <li class="item001"></li>
    <li class="item002"></li>
    <li class="item003"></li>
    <li class="item004"></li>
    <li class="item005"></li>
</ul>
```
Changing numbering base and direction
With @ modifier, you can change numbering direction (ascending or descending) and base (e.g. start value).

For example, to change direction, add @- after $:

```
ul>li.item$@-*5
```
```html
<ul>
    <li class="item5"></li>
    <li class="item4"></li>
    <li class="item3"></li>
    <li class="item2"></li>
    <li class="item1"></li>
</ul>
```
To change counter base value, add @N modifier to $:

```
ul>li.item$@3*5
```

```html
<ul>
    <li class="item3"></li>
    <li class="item4"></li>
    <li class="item5"></li>
    <li class="item6"></li>
    <li class="item7"></li>
</ul>
```

You can use these modifiers together:
```
ul>li.item$@-3*5
```
```html
<ul>
    <li class="item7"></li>
    <li class="item6"></li>
    <li class="item5"></li>
    <li class="item4"></li>
    <li class="item3"></li>
</ul>
```

Text: {}
You can use curly braces to add text to element:

```
a{Click me}
```

```html
<a href="">Click me</a>
```

```
(header > ul.nav > li*5) + footer
```

```html
<header>
	<ul class="nav">
		<li></li>
		<li></li>
		<li></li>
		<li></li>
		<li></li>
	</ul>
</header>
<footer></footer>
```


